# -*- coding: utf-8 -*-

import re
import os
import sys
import warnings

# import pandas as pd
import numpy as np

from collections import Counter
# from nltk import word_tokenize
# from tqdm import tqdm

from get_category import get_category

warnings.filterwarnings("ignore")

bias_words = [u'उज्ज्वला', u'योजना', u'फँसे', u'फसे', u'फस्स', u'भूखा', u'खाने-पीने', u'भूखे', u'प्यासा', u'प्यासे', \
    u'खेती', u'क्वारंटाइन', u'अस्पताल', u'बैंक', u'ब्लैक', u'सोशल', ]
    
# transcript = "मध्यप्रदेश राज्य के शिवपुरी जिला से श्याम लाल लोधी साझा मंच के माध्यम से कहते हैं, कि उनका भाई जो की उड़ीसा में काम करता है। जहाँ पर पुलिस वालों  ने उनके भाई के साथ मारपीट की। श्याम लाल लोधी ये भी बताते हैं, कि उनका भाई राशन लेने घर से बहार निकल था। उसी क्रम में पुलिस ने उनके भाई के साथ बुरा व्यवहार किया।अब वे साझा मंच से आग्रह कर रहें की उनकी मदद करें।"
# transcript = "उत्तरप्रदेश राज्य से रमेश सोनी ने गाज़ीपुर मोबाइल वाणी के माध्यम से बताया कि मजदूरों की आर्थिक महामारी के चलते हुए संकट की ख़बर को 26 मार्च 2020 को गाज़ीपुर मोबाइल वाणी पर चलाया गया था।जिसमे बताया गया था कि लॉक डाउन होने के कारण कई दिहाड़ी मज़दूर और मुसहर बस्ती के लोग आर्थिक संकट से जूझ रहे थे ।कई लोग भूखे थे। उनके पास खाने के लिए पैसे तक नहीं थे। इस समस्या को दुल्लाहपुर थाना अध्यक्ष ,जखनियाँ विकास खंड के अधिकारी व उप ज़िला अधिकारी को व्हाट्सप्प और फोन के माध्यम से फॉरवर्ड किया गया ।इस ख़बर को संज्ञान में लेते हुए 28 मार्च 2020 को दुल्लहपुर थानाध्यक्ष विनय सिंह सहित कई कांस्टेबल व राजस्व विभाग के लोगों द्वारा दुल्लहपुर रेलवे स्टेशन के पास रह रहे  दिहाड़ी मजदूर व मुसहर जाति के लोगों को क़रीब 10 दिनों का अनाज वितरण किया गया। जिसमें अरहर का दाल ,तेल ,चावल, आटा ,साबुन आदि वितरित किया गया।"
# transcript = "राहुल कुमार यादव साझा मंच मोबाइल वाणी के माध्यम से बताते हैं कि कोरोना वायरस पुरे देश में हंगामा मचा रहा है जिस कारण लोग संकट में हैं। कुछ मजदुर जो दूसरे प्रदेश में काम की तलाश में गए हैं ,वो भी फस गए हैं  . उन्हें बहुत सारी समस्याओं का सामना करना पड़ रहा है। कोरोना वायरस के कारण मजदुर इधर -उधर भाग रहे हैं जिससे कोरोना वायरस होने की संभावना बढ़ सकती है इसलिए सभी अपने घर में रहे और बाहर ना निकलें।"
# transcript = "गिद्धौर प्रखंड के मौरा पंचायत के लोग नमक-भात खाने के लिए मजबूर, पर कैसे ऑडियो पर क्लिक करें और पूरी खबर सुनें"
# transcript = "बिहार राज्य के जमुई जिला के पोस्ट पैराबदेया के थाना सोनो के गाव ओरैया से पंकज कुमार यादव मोबाइल वाणी के माध्यम से बताना चाहते है की इनके साथ 10 आदमी और है जो बैंगलोर गए थे काम के सिलसिले में लॉक डाउन होने के वजह से ये वह फस्स गए है।"
# transcript = "मधुबनी की महिला ईलाज के लिए दिल्ली गयी थी। लेकिन अचानक देश में लॉक डाउन होने के कारण वो वापस नहीं आ पा रही है। विस्तार पूर्वक जानकारी के लिए क्लिक करें ऑडियो पर और सुनें पूरी खबर। "
# transcript = "जखनिया विकासखंड के अंतर्गत कादीपुर गांव में असहाय लोगों को शासन एवं समाज सेवा के   तरफ से कोई राहत पैकेज ना मिलने से लोगों को काफी दिक्कतों का सामना करना पड़ रहा है लोगों ने इसकी शिकायत गाजीपुर मोबाइल वाणी के टीम से  गुहार लगाइए।"
#transcript = "मानेसर से एक श्रोता बताते हैं कि उन्हें खाने -पीने की समस्या हो रही है।"
# transcript = "नमस्ते गुड आफ्टरनून में कन्वर्ट कर बोल रहा हूं त्रिपुरा से मेरा एक सवाल पूछा था कि सेंट्रल गवर्नमेंट की ओर से जो दिव्यांग और बुजुर्ग लोगों को करुणा वायरस के लिए जो योगदान घोषित किया गया जिस लव टंकी चलते लोगों थोड़ा बीपीसी अंगूर देख लो कि परिवार को थोड़ा रात दिन के लिए ₹1000 दिया जाएगा क्योंकि मेरा अपना टेंशन तो देखो गारमेंट की ओर से मिल रहा है स्टेट गवर्नमेंट पास मेरा पूरा डिटेल है अकाउंट नंबर वगैरह सब कुछ डिटेल में और गौर सेंट्रल गवर्नमेंट द्वारा जो हमें जो ₹1 हेल्प किया जाएगा हमें बता दिया जाएगा इसके लिए अलग से हमें फॉर्म भरना पड़ेगा या फिर गवर्नमेंट की ओर से जो भी रिक्वेस्ट अपनी मैडम के पास चला जाएगा जरा कृपया करके हमें स्पष्ट कीजिए इस बात को आरक्षण के लिए तैयार हूं लेकिन हमें जानकारी चाहिए स्पष्ट जानकारी दीजिए कृपया करके हमें आगे जाकर कोई मुश्किल ना हो और कहां से कर लेना पड़ेगा और क्या क्या कहना होगा आप लोगों में किसी पंचायत से  थैंक यू"
# transcript = "मेनी मेनी अल्फाबेट करमा ग्राम माधवपुर चरण वाले डिस्टिक औरंगाबाद से बात कर रहा हूं पेंशन के बारे में जानकारी लेना चाहता हूं टेंशन अभी तक हमारे मिला नहीं है और टेंशन कम से कम 1000 महीना होना चाहिए और इंद्रावास भी नहीं हुआ हम लोग सफल कर रहे हैं कर कर डाल कर रखे हैं एक गर्मी पड़ रही है गर्मी में बहुत परेशानी है बीमारी है यह वह बहुत हरितगृह के दिक्कत हो इसलिए मोदी जी से अनुरोध है कि राजकुमार को अकाउंट नंबर में बैलेंस भेजें मेरा नंबर है अकाउंट नंबर है 70 9701 ट्रिपल जीरो 445 से मध्य ग्रामीण बिहार बैंक का है इस नंबर पर डलवा दें"
# transcript = "जिमी त्रिपुरा के बोल रहा हूं अंदर बात कर रहा हूं मैं एक सवाल पूछा था कि सरकार द्वारा जो लोग दम घोषित किया गया और इसके बाद हमारे फाइनेंस नमस्कार सीतारमन भी कह रही थी कि आज दिव्यांगों बुजुर्गों को पेंशन रुपया स्टेट गवर्नमेंट की ओर से टेंशन हमें मिल रहा है और यह तो प्राइम मिनिस्टर द्वारा और केंद्र सरकार द्वारा जो ₹1000 दिया जाएगा एक-एक ₹1000 पानी के लिए भी इस सुविधा का लाभ लेने के लिए क्या में अलग से फॉर्म भरना पड़ेगा बिहार के लिए जो स्टेट बैंक जो चल रहा है अभी से अकाउंट में अपने आप पैसा आ जाएगा या फिर हमें अलग रूप से फॉर्म भरना पड़ेगा कृपया करके इस सवाल का जवाब दीजिए"
# transcript = "जेएनयू यूनिवर्सिटी पुराण से कानून अंदर बोल रहा हूं मेरा कहना यही है कि लोटन के दौरान जो श्रमिक भाई-बहनों और जो-जो दिहाड़ी मजदूर ने जो जो राजमिस्त्री का काम करते जैसे मेरे पापा राजनीति का काम करते हैं अभी तो काम बंद है खाने पीने में बहुत दिक्कत हो रहा है जहां पूरे देश में बहुत नाजुक स्थिति है मजदूर भाइयों और बहनों को मेरा सरकार से यही निवेदन है कि ईरान बढ़ाया जाए पानी की जरूरत है जो मजदूर दिव्यांशु कमजोर वर्ग के लोगों के लोग हैं लोग लोगों और रहता है कभी आ जानी चाहिए चावल दाल खाने की चीज रुपया जैकेट और भारी मात्रा में उपलब्ध कराने की आवश्यकता है नहीं तो जो गरीब लोग हैं जो शायद 70% गरीब है देश की बुक और बुरी तरह से फंक्शन जोधपुरी उनका हल अकबर और गंभीर होता चला जाएगा और बाकी जो जो मंत्री मिनिस्टर बड़े बड़े ऑफिसर लोग इनका क्या इनका टुकुर जाने के लिए बहुत बड़ी बात नहीं है लेकिन तेरे लिए बहुत मुश्किल है मुश्किल को देखते हुए सरकार को लौटा हूं दोबारा घोषित करने के लिए लेकिन गरीब लोगों को फायदा हो हर इलाके के गरीब स्विच अकाउंट में कम से कम आधार कार्ड ₹10000"
#transcript = "हेलो सर मैं रोशन बोल रहा हूं  हेलो  हेलो  क्लोज करने रोशन बोल रहा हूं  सिकंदरपुर बलिया जिला का  सर मैं एक एक रिक्शा चलाता हूं 2 मिनट में रास्ता बंद हो गया है  खाने-पीने कुछ नहीं है  गोरख मेरे घर में बाबा के जन्म मृत्यु हो गई है  2 महीने तक बैठे हैं बैठे हैं घर में कुछ पैसा ऐसा कुछ भी नहीं है"
#transcript = "\xe0\xa4\xb9\xe0\xa5\x87\xe0\xa4\xb2\xe0\xa5\x8b \xe0\xa4\xb8\xe0\xa4\xb0 \xe0\xa4\xae\xe0\xa5\x88\xe0\xa4\x82 \xe0\xa4\xb0\xe0\xa5\x8b\xe0\xa4\xb6\xe0\xa4\xa8 \xe0\xa4\xac\xe0\xa5\x8b\xe0\xa4\xb2 \xe0\xa4\xb0\xe0\xa4\xb9\xe0\xa4\xbe \xe0\xa4\xb9\xe0\xa5\x82\xe0\xa4\x82  \xe0\xa4\xb9\xe0\xa5\x87\xe0\xa4\xb2\xe0\xa5\x8b  \xe0\xa4\xb9\xe0\xa5\x87\xe0\xa4\xb2\xe0\xa5\x8b  \xe0\xa4\x95\xe0\xa5\x8d\xe0\xa4\xb2\xe0\xa5\x8b\xe0\xa4\x9c \xe0\xa4\x95\xe0\xa4\xb0\xe0\xa4\xa8\xe0\xa5\x87 \xe0\xa4\xb0\xe0\xa5\x8b\xe0\xa4\xb6\xe0\xa4\xa8 \xe0\xa4\xac\xe0\xa5\x8b\xe0\xa4\xb2 \xe0\xa4\xb0\xe0\xa4\xb9\xe0\xa4\xbe \xe0\xa4\xb9\xe0\xa5\x82\xe0\xa4\x82  \xe0\xa4\xb8\xe0\xa4\xbf\xe0\xa4\x95\xe0\xa4\x82\xe0\xa4\xa6\xe0\xa4\xb0\xe0\xa4\xaa\xe0\xa5\x81\xe0\xa4\xb0 \xe0\xa4\xac\xe0\xa4\xb2\xe0\xa4\xbf\xe0\xa4\xaf\xe0\xa4\xbe \xe0\xa4\x9c\xe0\xa4\xbf\xe0\xa4\xb2\xe0\xa4\xbe \xe0\xa4\x95\xe0\xa4\xbe  \xe0\xa4\xb8\xe0\xa4\xb0 \xe0\xa4\xae\xe0\xa5\x88\xe0\xa4\x82 \xe0\xa4\x8f\xe0\xa4\x95 \xe0\xa4\x8f\xe0\xa4\x95 \xe0\xa4\xb0\xe0\xa4\xbf\xe0\xa4\x95\xe0\xa5\x8d\xe0\xa4\xb6\xe0\xa4\xbe \xe0\xa4\x9a\xe0\xa4\xb2\xe0\xa4\xbe\xe0\xa4\xa4\xe0\xa4\xbe \xe0\xa4\xb9\xe0\xa5\x82\xe0\xa4\x82 2 \xe0\xa4\xae\xe0\xa4\xbf\xe0\xa4\xa8\xe0\xa4\x9f \xe0\xa4\xae\xe0\xa5\x87\xe0\xa4\x82 \xe0\xa4\xb0\xe0\xa4\xbe\xe0\xa4\xb8\xe0\xa5\x8d\xe0\xa4\xa4\xe0\xa4\xbe \xe0\xa4\xac\xe0\xa4\x82\xe0\xa4\xa6 \xe0\xa4\xb9\xe0\xa5\x8b \xe0\xa4\x97\xe0\xa4\xaf\xe0\xa4\xbe \xe0\xa4\xb9\xe0\xa5\x88  \xe0\xa4\x96\xe0\xa4\xbe\xe0\xa4\xa8\xe0\xa5\x87-\xe0\xa4\xaa\xe0\xa5\x80\xe0\xa4\xa8\xe0\xa5\x87 \xe0\xa4\x95\xe0\xa5\x81\xe0\xa4\x9b \xe0\xa4\xa8\xe0\xa4\xb9\xe0\xa5\x80\xe0\xa4\x82 \xe0\xa4\xb9\xe0\xa5\x88  \xe0\xa4\x97\xe0\xa5\x8b\xe0\xa4\xb0\xe0\xa4\x96 \xe0\xa4\xae\xe0\xa5\x87\xe0\xa4\xb0\xe0\xa5\x87 \xe0\xa4\x98\xe0\xa4\xb0 \xe0\xa4\xae\xe0\xa5\x87\xe0\xa4\x82 \xe0\xa4\xac\xe0\xa4\xbe\xe0\xa4\xac\xe0\xa4\xbe \xe0\xa4\x95\xe0\xa5\x87 \xe0\xa4\x9c\xe0\xa4\xa8\xe0\xa5\x8d\xe0\xa4\xae \xe0\xa4\xae\xe0\xa5\x83\xe0\xa4\xa4\xe0\xa5\x8d\xe0\xa4\xaf\xe0\xa5\x81 \xe0\xa4\xb9\xe0\xa5\x8b \xe0\xa4\x97\xe0\xa4\x88 \xe0\xa4\xb9\xe0\xa5\x88  2 \xe0\xa4\xae\xe0\xa4\xb9\xe0\xa5\x80\xe0\xa4\xa8\xe0\xa5\x87 \xe0\xa4\xa4\xe0\xa4\x95 \xe0\xa4\xac\xe0\xa5\x88\xe0\xa4\xa0\xe0\xa5\x87 \xe0\xa4\xb9\xe0\xa5\x88\xe0\xa4\x82 \xe0\xa4\xac\xe0\xa5\x88\xe0\xa4\xa0\xe0\xa5\x87 \xe0\xa4\xb9\xe0\xa5\x88\xe0\xa4\x82 \xe0\xa4\x98\xe0\xa4\xb0 \xe0\xa4\xae\xe0\xa5\x87\xe0\xa4\x82 \xe0\xa4\x95\xe0\xa5\x81\xe0\xa4\x9b \xe0\xa4\xaa\xe0\xa5\x88\xe0\xa4\xb8\xe0\xa4\xbe \xe0\xa4\x90\xe0\xa4\xb8\xe0\xa4\xbe \xe0\xa4\x95\xe0\xa5\x81\xe0\xa4\x9b \xe0\xa4\xad\xe0\xa5\x80 \xe0\xa4\xa8\xe0\xa4\xb9\xe0\xa5\x80\xe0\xa4\x82 \xe0\xa4\xb9\xe0\xa5\x88"
# transcript = "मेरा नाम उज्ज्वला प्रकाश कितनी है मैं रांची झारखंड से बोल रहा हूं मेरा टेंशन 2 साल होने जा रहा है लेकिन आज तक मेरा खाता में पैसा भी नहीं आया है तू क्या हो रहा है जिसे उन्हें गुलाब दान में नर परिवार वालों का"
# transcript = "\u092e\u0947\u0930\u093e \u0928\u093e\u092e \u092a\u094d\u0930\u0915\u093e\u0936 \u0915\u093f\u0924\u0928\u0940 \u0939\u0948 \u092e\u0948\u0902 \u0930\u093e\u0902\u091a\u0940 \u091d\u093e\u0930\u0916\u0902\u0921 \u0938\u0947 \u092c\u094b\u0932 \u0930\u0939\u093e \u0939\u0942\u0902 \u092e\u0947\u0930\u093e \u091f\u0947\u0902\u0936\u0928 2 \u0938\u093e\u0932 \u0939\u094b\u0928\u0947 \u091c\u093e \u0930\u0939\u093e \u0939\u0948 \u0932\u0947\u0915\u093f\u0928 \u0906\u091c \u0924\u0915 \u092e\u0947"
transcript = "उज्ज्वला"
cnt = Counter()
transcript = ' '.join(re.split('\||।', transcript)).strip()
print("Transcript is : {}".format(transcript))
# words = word_tokenize(transcript)
words = transcript.split(' ')
for word in words:
    print(word)

print("Bias words : {}".format(bias_words))
print("Words : {}".format(words))
for word in words:
    if word in bias_words:
        cnt[word] += 3
    else:
        cnt[word] += 1
print(get_category(cnt))
