# -*- coding: utf-8 -*-
import os
import sys
import pandas as pd
import polyglot
import pprint
import warnings
from locationEntityMatch import getEntityLocation
from polyglot_location_analysis import getPolyglotLocation, getLocation
from main_loc import sthaan

warnings.filterwarnings("ignore")

def get_clean_locs(locs):
    # Unpack the tuples to make the locs a list of tuples. [(['पंजाब', 'उत्तर प्रदेश'], ['फिरोज़पुर', 'शाहजहाँपुर'], ['जलालाबाद'])] -> [(पंजाब, फिरोज़पुर, जलालाबाद), (उत्तर प्रदेश, शाहजहाँपुर, जलालाबाद)]
    max_len = 0
    new_locs = []
    print(locs)
    for loc in locs:
        new_loc = []
        for l in loc:
            print("L :", l)
            max_len = max(len(l[0]), len(l[1]), len(l[2]))
            for idx in range(3):
                while len(l[idx]) < max_len:
                    if len(l[idx]) != 0:
                        l[idx].append(l[idx][-1])
                    else:
                        l[idx].append('')
            new_loc.extend([i for i in zip(l[0], l[1], l[2])])
        new_locs.append(new_loc)
    return new_locs

def all_tups_zero_len(tups):
    max_len = 0
    for tup in tups:
        max_len = max(len(tup), max_len)
    if max_len == 0:
        return True
    else:
        return False

def get_final_locs(auto_locs):
    final_locs = []
    print(auto_locs)
    for auto_loc in auto_locs:
        loc_val = ''
        for idx, loc in enumerate(auto_loc):
            if idx > 0:
                loc_val += '\n'
            try:
                if len(loc[2]) != 0:
                    loc_val += str(loc[2][0]) + ', ' + str(loc[1][0]) + ', ' + str(loc[0][0])
                elif len(loc[1]) != 0:
                    loc_val += str(loc[1][0]) + ', ' + str(loc[0][0])
                else:
                    loc_val += str(loc[0][0])
            except:
                loc_val += ''
        final_locs.append(loc_val)
    return final_locs

def get_secondary_locs(final_locs):
    primary_locs = []
    secondary_locs = []
    for loc in final_locs:
        l = loc.split('\n')
        try:
            l1 = l[0]
        except:
            l1 = ''
        try:
            l2 = '\n'.join(l[1:])
        except:
            l2 = ''
        primary_locs.append(l1)
        secondary_locs.append(l2)
    return primary_locs, secondary_locs

def get_st_abrev(st):
    abrev_dict = {'JAMMU & KASHMIR': ['jk'], 'HIMACHAL PRADESH': ['hp'], 'PUNJAB': ['pb'],
        'CHANDIGARH': ['ch'], 'UTTARAKHAND': ['uk'], 'HARYANA': ['hr'],
        'NCT OF DELHI': ['delhi', 'dl- ncr', 'dl'], 'RAJASTHAN': ['rj'], 
        'UTTAR PRADESH': ['up','uttar pradesh'], 'BIHAR': ['bihar', 'br'], 
        'SIKKIM': ['sk'], 'ARUNACHAL PRADESH': ['ar'], 'NAGALAND': ['nl'], 'MANIPUR': ['mn'], 
        'MIZORAM': ['mz'], 'TRIPURA': ['tr'], 'MEGHALAYA': ['ml'], 'ASSAM': ['assam', 'as'] , 
        'WEST BENGAL': ['wb'], 'JHARKHAND': ['jh', 'jharkhand'], 'ODISHA': ['odisha', 'od', 'or'], 
        'CHHATTISGARH': ['cg', 'chhattisgarh'], 'MADHYA PRADESH': ['mp'], 'GUJARAT': ['gj'], 
        'DAMAN & DIU': ['dd'], 'DADRA & NAGAR HAVELI': ['dh', 'dn'], 'MAHARASHTRA': ['mh'], 
        'ANDHRA PRADESH': ['andhra pradesh', 'ap'], 'KARNATAKA': ['ka'], 'GOA': ['ga'], 
        'LAKSHADWEEP': ['ld'], 'KERALA': ['kl'], 'TAMIL NADU': ['tn'], 'PUDUCHERRY': ['py'], 
        'ANDAMAN & NICOBAR ISLANDS': ['andaman', 'andaman and nicobar', 'an'], 'TELANGANA': ['ts']
    }
    return abrev_dict[st]

def get_filetered_id(server_loc_df, st_en_list, dist_en, sd_en, blk_en='', panch_en=''):
    loc_id = -1

    try:
        # print("dist ", dist_en.strip())
        server_loc_df = server_loc_df[server_loc_df['States'].str.strip().apply(lambda x: x in st_en_list)\
            & (server_loc_df['Districts'].str.strip() == dist_en.strip()) & (server_loc_df['Sub Districts'].str.strip() == sd_en.strip())\
            & (server_loc_df['Blocks'].str.strip() == blk_en.strip()) & (server_loc_df['Panchayats'].str.strip() == panch_en.strip())]
        # print("server loc df ", server_loc_df)
        if not server_loc_df.empty and len(server_loc_df) == 1:
            loc_id = int(server_loc_df['id'])
    except Exception as e:
        print("Exception in ID data frame : {}".format(str(e)))
        loc_id = -1

    return loc_id

def get_loc_id(inferred_loc, ai_id, server_id, hi_en_df, server_loc_df):
    # Ensure that na values are filled with '' in the Dataframes
    locs = inferred_loc.split(',')
    locs = [l.strip() for l in locs]

    for idx in range(len(locs), 3):         # to make all locations of form sd, dist, st
        locs.insert(0,'')

    # Get the locations and convert them into English
    sd, dist, st = locs
    print("Sd : {}, dist : {}, st : {}".format(sd, dist, st))
    try:
        st_en, dist_en, sd_en = [hi_en_df[hi_en_df['name_hi']==x]['TownVillgName'].iloc[0].strip() if x else '' for x in [st, dist, sd]]
    except Exception as e:
        print("Error in converting in English")
        sys.exit()
    dist_en = dist_en.lower()
    sd_en = sd_en.lower()

    # Get the location id from server location sheet
    try:
        st_en_list = get_st_abrev(st_en) # get the state abbreviation as available in server data
    except:
        print("Abrev dict error")
        return -1

    # hierarchical search
    server_loc_df = server_loc_df[(server_loc_df['ai']==ai_id) & (server_loc_df['server']==server_id)]

    # print("server loc df", server_loc_df)
    loc_id = -1 # this ID gets updated hierarchically
    try:
        if len(sd_en) > 0:  # This means state and district are also present
            loc_id = get_filetered_id(server_loc_df, st_en_list, dist_en, sd_en)   # Get complete st, dist, sd ID
        if len(dist_en) > 0 and loc_id == -1:
            loc_id = get_filetered_id(server_loc_df, st_en_list, dist_en, '')  # Get only the state and district ID
        if len(st_en_list) > 0 and loc_id == -1:
            loc_id = get_filetered_id(server_loc_df, st_en_list, '', '')       # Get only the state ID
    except Exception as e:
        print("Exception in extracting IDs : {}".format(str(e)))
        loc_id = -1

    return loc_id

# u = "लाइव उत्तर प्रदेश जिला बांदा का लिखवा चमेली चौराहा में रहता हूं शनिवार को एकदम"
# u = "उत्तर प्रदेश बी एच यू वाराणसी"
# u = "मेरा नाम का जनरेटर में टेलनगन के जिला में रहते हैं"
# u = "अशोक तेलंगाना जिला में जाते हैं"
# u = "मेरा नाम का जनरेटर में उत्तराखंड के जिला अल्मोड़ा"
# u = "हम मध्य प्रदेश मध्य प्रदेश के पिपरिया शहर में रहते हैं अपने घर को जाना चाहते है"
# u = "हम होशंगाबाद शहर में रहते हैं अपने घर पिपरिया को जाना चाहते है"
# u = "हम बिजावर शहर में रहते हैं अपने घर को जाना चाहते है"
# u = "अशोक बिहार छपरा जिला में जाते हैं"
# u = "मेरा नाम है और मेरा उत्तर प्रदेश राज्य में रहता हूं और मेरा जिला छपरा सरन और मेरे गांव का नाम शीतलपुर कोठी है धन्यवाद"
# u = "मैं सिद्धेश अभियान जिला का छत्तीसगढ़ में रहने वाला हूं ब्लाइंड स्कूल आरा वालों में पढ़ाई करता हूं मैं नवी कक्षा में पढ़ाई करता हूं अरे नाम और गांव जिला"
# u = "दिल्ली से बबलू यादव ,साझा मंच मोबाइल वाणी के माध्यम से बता रहे है कि उनके पास पैसे नहीं है जिस कारण उन्हें राशन को लेकर परेशानी हो रही है"
# u = "दिल्ली एनसीआर हरियाणा बहादुरगढ़ से मनोहर लाल कश्यप साझा मंच मोबाइल वाणी के माध्यम से बताते हैं कि दिनांक 23-03-20 के दोपहर एक खबर का प्रसारण साझा मंच मोबाइल वाणी पर किया गया था। जिसका शीर्षक था 'लॉक डाउन के बावजूद कम्पनी जबरन करा रही मजदूरों से काम'। खबर में बताया गया था कि बहादुरगढ़ सेक्टर  16 - 17 व टिकरी बॉर्डर एमआई में कुछ कम्पनियाँ खुली हुई है ,जिसमें श्रमिकों को धमका कर काम कराया जा रहा है।विशेषकर सेक्टर 16 प्लॉट नंबर 168 की पुख्ता जानकारी थी कि यहाँ कार्य कराया जा रहा है।इस खबर को क्षेत्रीय एसडीएम , श्रम अधिकारी व अन्य अधिकारीयों को फॉरवर्ड कर इस विषय पर बात की गयी। जिसके फलस्वरूप प्रशाशन हरकत में आयी और 15 मिनट में ही सेक्टर 16 प्लॉट नंबर 168 के कंपनी में जाकर दिन के लगभग दोपहर 1 बजे बंद कराया गया। इससे सभी श्रमिकों को कंपनी बंद कराये जाने से राहत मिली और उन्हें हिदायत भी दी गयी कि 31 मार्च तक कम्पनी में कार्य हेतु ना आएँ।"
# u = "उत्तर प्रदेश राज्य के जखनिया से अखिलेश मिश्रा गाजीपुर मोबाइल वाणी के माध्यम से यह बताया कि ग़ाज़ीपुर के दुल्लापुर में लॉक डाउन की वजह से बिजली की बहुत खपत हो रही थी,जिससे आम जनता को काफी मुश्किलों का सामना करना पड़ रहा था।  इस समस्या को ध्यान में रखते हुए गाज़ीपुर मोबाइल वाणी के सामुदायिक संवाददाता अखिलेश मिश्रा  ने इस ख़बर को 2 दिन पूर्व यानि 25 मार्च 2020 को गाज़ीपुर मोबाइल वाणी पर प्रसारित किया। इसके बाद उन्होंने इस ख़बर को जिले के बिजली विभाग अधिकारी एस०डी०ओ,एक्स०इ०एन और जे०इ के साथ साथ जिला अधिकारी को भी फारवर्ड किया था। साथ ही उन्होंने यह जानने की कोशिश भी की थी की आखिर इस अनिश्चित बिजली कटौती का कारण क्या है। जिसपर अधिकारियों ने बताया था की आज कुछ समस्या है। असर यह हुआ कि अधिकारियों ने इस ख़बर को संज्ञान में लेते हुए इस समस्या का समाधान कराया तथा रोजाना अट्ठाहरा घंटे बिजली की आपूर्ति सुनिश्चित करने की बात कही । दुल्लापुर निवासी ग्रामीण सुनीता से बात करने पर उन्होंने बताया कि वो सिलाई का कार्य करती है तथा आज से कुछ दिन पहले  बिजली की बहुत कटौती हो रही थी बच्चे पढ़ नहीं पा रहे थे तथा पूरा राज्य लॉक डाउन होने के कारण घर से निकलना भी बंद हो गया था। इस बीच बिजली कट जाती थी तो घर पर काफी दिक्कतों का सामना करना पड़ रहा था। पर अब इस समस्या से छुटकारा मिल गया है। वो गाज़ीपुर मोबाइल वाणी को धन्यवाद दे रही हैं।"
# u = "अजय मिश्रा ने साझा मंच मोबाइल वाणी के माध्यम से बताया कि ओडिशा के लगभग 40 परिवार तिरुपुर में फंस गए है।"
# u = "कोरोनावायरस के चलते जहां किसानों का बुरा हाल है। यह लोग काफी परेशान है। वहीं सरकार द्वारा घोषणा किया गया कि इन्हें ₹2000 की तत्काल सहायता राशि प्रदान की जाएगी लेकिन अब तक इसका लाभ पूरे किसानों को नहीं मिल सका है। प्रमोद वर्मा की बात गाजीपुर मोबाइल वाणी के माध्यम से जलालाबाद के एक किसान से हुई उन्होंने बताया कि अब तक उन्हें 2000 रूपए की सहायता राशि नहीं प्राप्त हुई है जिसे यह काफी परेशान हैं।"
# u = "उत्तरप्रदेश राज्य ,ग़ाज़ीपुर जिला के जलालाबाद प्रखंड से उपेंद्र कुमार ने ग़ाज़ीपुर मोबाइल वाणी के माध्यम से बताया कि जैसे ही लोगों को पता चला है कि गाजीपुर लॉकडाउन से बाहर हैं जखनियां और दुल्लाहपुर कि दुकानों को लोग धड़ा धड़ चालू कर दिया गया। बाजारों में चारो तरफ सब्जियों की दुकानें सज गई और चारो तरफ भीड़ नजर आई।कोरोना का खौफ आम आदमी की थाली तक जा पहुंचा है। इस कारण रोजमर्रा में प्रयोग होने वाली वस्तुओं में बीते दिनों की तुलना में सब्जियों के भाव में काफी उछाल आ गया है। आलू, प्याज, टमाटर, गोभी, भिंडी और बैंगन के रेट में अचानक उछाल आ गया है। इसकी प्रमुख वजह कोरोना को लेकर एक दो दिन नहीं, पुरे सप्ताह के लिए सब्ज़ियाँ स्टोर कर रहे हैं। वहीं व्यापारी ज्यादा मुनाफा कमाने के चक्कर में सब्जियों की काला बाज़ारी भी कर रहे हैं।  इस भयावह स्थिति से निपटने का तरीका ही बचाव है तो लोगों ने अपना दिमाग लगाना शुरू कर दिया है। लोगों के मन में यह चिंता सता रही है कि मार्किट व अस्पताल न जाने कब प्रशासन जिला को लॉकडाउन कर दे।"
# u = "उत्तरप्रदेश राज्य ,ग़ाज़ीपुर जिला के जलालाबाद प्रखंड से उपेंद्र कुमार ने ग़ाज़ीपुर मोबाइल वाणी के माध्यम से बताया कि जैसे ही लोगों को पता चला है कि गाजीपुर लॉकडाउन से बाहर हैं जखनियां और दुल्लाहपुर कि दुकानों को लोग धड़ा धड़ चालू कर दिया गया। बाजारों में चारो तरफ सब्जियों की दुकानें सज गई और चारो तरफ भीड़ नजर आई।कोरोना का खौफ आम आदमी की थाली तक जा पहुंचा है। इस कारण रोजमर्रा में प्रयोग होने वाली वस्तुओं में बीते दिनों की तुलना में सब्जियों के भाव में काफी उछाल आ गया है। आलू, प्याज, टमाटर, गोभी, भिंडी और बैंगन के रेट में अचानक उछाल आ गया है। इसकी प्रमुख वजह कोरोना को लेकर एक दो दिन नहीं, पुरे सप्ताह के लिए सब्ज़ियाँ स्टोर कर रहे हैं। वहीं व्यापारी ज्यादा मुनाफा कमाने के चक्कर में सब्जियों की काला बाज़ारी भी कर रहे हैं।  इस भयावह स्थिति से निपटने का तरीका ही बचाव है तो लोगों ने अपना दिमाग लगाना शुरू कर दिया है। लोगों के मन में यह चिंता सता रही है कि मार्किट व अस्पताल न जाने कब प्रशासन जिला को लॉकडाउन कर दे।"
# u = "खंडवा ज़िला के रहने वाले अजित अपने घर को जाना चाहते है।"
#u = "दिल्ली एनसीआर के कापसहेड़ा से हीरालाल ने साझा मंच मोबाइल वाणी के माध्यम से बताया कि कई प्रवासी मज़दूर कापसहेड़ा बॉर्डर पर फँसे हुए है। उन्हें बिहार जाना है। साझा मंच के माध्यम से सहायता चाहते है।"
# loc = sthaan(s)
# loc2 = sthaan(t)
# u = "प्रतापगढ़ ज़िला के अवधानपुर गांव से मुन्नी देवी बता रही है कि वो हीलिंग फील्ड फाउंडेशन की सुवेक्षक है।उनके गांव में बहुत लोग परेशान है। उन्हें खाने पीने को लेकर समस्या हो रही है। कुछ लोग स्कूल में बंद थे उन्हें प्रधान द्वारा राशन दिया गया। अब शायद राशन देना बंद कर दिए है। उनका राशन भी पैसे लेकर दिया गया है। बहुत से लोगों को राशन मुफ़्त में भी दिए है।अगले महीनें का अँगूठा लगाया हुआ राशन नहीं दिए। दो तीन बार बेटी के जाने पर उनसे पैसे लेकर राशन दिया गया। प्रधान द्वारा कोई सहायता नहीं मिली।उनके पति बाहर रहते है। उन्हें पैसा को लेकर बहुत दिक्क़त है। उनको माता आई है इसलिए वो कही बाहर आना जाना नहीं कर रही है। उनके तीन चार बच्चे है। गांव की जो भी समस्या होती है वो सुनती है। बाज़ार व स्कूल सब बंद है। प्रधान कुछ काम के लिए आने जाने दे रहे है। जिसको जानते है उन्हें यहाँ वहाँ आने जाने की छूट दी जा रही है। बाकियों को ऐसी अनुमति नहीं है।"
# u = "तमिलनाडु राज्य के तिरुपुर जिला से संगीता साझा मंच मोबाइल वाणी के माध्यम से कहती हैं ,कि कोरोना वायरस को देखते हुए सरकार ने जो पुरे देश में लोक डाउन किया है। जिस वजह से समस्याओं का सामना करना पड़ रहा है। कम्पनियाँ बंद हो गई है। उनके पास खाने के लिए राशन नहीं है। उन्हें मदद की जरुरत है।"
# u = "उत्तरप्रदेश राज्य ,ग़ाज़ीपुर जिला के जलालाबाद प्रखंड से उपेंद्र कुमार ने ग़ाज़ीपुर मोबाइल वाणी के माध्यम से बताया कि जैसे ही लोगों को पता चला है कि गाजीपुर लॉकडाउन से बाहर हैं जखनियां और दुल्लाहपुर कि दुकानों को लोग धड़ा धड़ चालू कर दिया गया। बाजारों में चारो तरफ सब्जियों की दुकानें सज गई और चारो तरफ भीड़ नजर आई।कोरोना का खौफ आम आदमी की थाली तक जा पहुंचा है। इस कारण रोजमर्रा में प्रयोग होने वाली वस्तुओं में बीते दिनों की तुलना में सब्जियों के भाव में काफी उछाल आ गया है। आलू, प्याज, टमाटर, गोभी, भिंडी और बैंगन के रेट में अचानक उछाल आ गया है। इसकी प्रमुख वजह कोरोना को लेकर एक दो दिन नहीं, पुरे सप्ताह के लिए सब्ज़ियाँ स्टोर कर रहे हैं। वहीं व्यापारी ज्यादा मुनाफा कमाने के चक्कर में सब्जियों की काला बाज़ारी भी कर रहे हैं।  इस भयावह स्थिति से निपटने का तरीका ही बचाव है तो लोगों ने अपना दिमाग लगाना शुरू कर दिया है। लोगों के मन में यह चिंता सता रही है कि मार्किट व अस्पताल न जाने कब प्रशासन जिला को लॉकडाउन कर दे।"
# u = "तमिलनाडु राज्य के तिरुपुर से मीणा कुमारी साझा मंच मोबाइल वाणी के माध्यम से बता रही है कि तिरुपुर में पूरी तरह से लॉक डाउन कर दिया गया है इसका सबसे ज़ादा प्रभाव मजदूरों को भुगतना पड़ रहा है। पैसे के आभाव के कारन अपना रोजी रोटी तक नहीं चला पा रहे है।"
# u = "हमारे घर जाने के लिए पैसे हमारे स्पेन के कंपनी बंद होने से काफी तकलीफ में  कृपया करके हम लोग को राशन  दिया जाए ताकि हम लोग खा पी सके अपने बच्चों को रखता देशभक्ति  हम पर बहुत कराओ कार होगी  अंतरीन बच्चे लेकर आंखें फर्स्ट पर आए हमारे घर जाने के लिए पैसे यहां खाने-पीने की तकलीफ हो चुकी है  मानेसर देखो गांव से हम बोल रहे हैं"
# u = "कर्नाटक कर्नाटक"
# u = "बिहार जिला के बिहार राज्य के दरभंगा जिला में रहती"
# u = "मंदसौर जिला मध्य प्रदेश गांव जेतपुरा का रहने वाला हूं वर्तमान में दिल्ली ख्याला में रह रहा हूं"
# u = "जलालाबाद"
# u = "नमस्कार जोहार पोटका प्रखंड पूर्वी सिंहभूम झारखंड से हैं चक्रधर स्वामी विवेकानंद जी के कुछ लाइन सुनाना चाहता हूं दुख की बात तो यह है कि भारतवर्ष में जहां पहले कभी नहीं था थोड़े दिन में इस भ्रम में प्रवेश किया है वह भरम या है कि अधिकारी का विचार ना कर सभी के लिए समान व्यवस्था देना तो यह है कि सभी के लिए एक मार्ग नहीं हो सकता मेरी पद्धति आवश्यक नहीं है कि वह आपकी भी हो आप सभी लोग जानते हैं कि सन्यासी के जीवन का आधार है सभी हिंदू शास्त्र सभी को त्यागी होने का आदेश देते हैं जो जीवन की परिवर्तित व्यवस्था में प्यार नहीं करता वह हिंदू नहीं है और ना उससे उसे अपने हिंदू कहने का कोई बेकार है साल के सभी लोगों का आनंद लेने लेकर प्रत्येक हिंदू को अंत में अंत में त्याग करना ही होगा यही हिंदुओं का आदर्श हम जानते हैं कि वो के द्वारा अंतः स्थल में जिस समय यह धारणा जम जाएगी कि संसार असार है उसी समय उसका क्या करना होगा आप जब आप भली-भांति परीक्षण करके जाएंगे की जय जगत 4G केवल रात है धन्यवाद "
# u = "राजा दशरथ पुत्र रत्न प्राप्ति के लिए जो अपने को धन धाम करो यहां से राजा दशरथ राम लक्ष्मण भरत शत्रुघ्न शत्रुघ्न के पुत्र को प्राप्त किए थाम मोबाइल पानी के लिए राजा दशरथ ने तपोभूमि पर राजा दशरथ पुत्र प्राप्ति के लिए रिश्ता किए थे वह तपोभूमि पर आज बाबा आनंद दास का प्रतिमा अनावरण होगा जहां सैकलोग आए हुए हैं साथ में दो भाग हैं जिनकी स्टेचू बनी हुई है इस स्थल पर लोग अपने को आराम करके इनका सेवन करके जल का सेवन से रोग मुक्त होते हैं इसे ऋषि कुंड कहस्पिटल 5 किलोमीटर पैदल चलने के बाद ऋषि कुंड के जल जल जल के झरने का सैलानियों भी लुटाते हैं गौरतलब बात बिहार सरकार के ग्रामीण कार्य मंत्री श्री कुंड को विगे दुखद बात है कि ऋषि कुंड के पहुंच पार्टी जानिया आधा किलो मीटर जीर्ण शीर्ण अवस्था में है जहां अगर मलमास मेला यह विजय कुमार विजय कुमार के यहां एक मेला बेडशिनों तक चलती है जिसे देखकर यहां के ग्रामीण अपने जीवन मुंगेर मोबाइल बॉडी के लिए बढ़िया फूल सिंह नरेश आनंद की रिपोर्ट"
# u = "मेरा नाम रिंकी कुमारी नाग आंगनबाड़ी सेविकाओं जिला नालंदा स्वास्थ्य केंद्र का कोई मैं स्वास्थ्य के बारे में बताती हूं महिला को खाता हूं वैसे 5:00 का समय पर खाना खाने के लिए बताती हूं और समाज सेवा करता दिलवाने के लिए बताती हूं आरक्षण 5066 मातरम को संपन्न कराने के लिए बता दूं या रहने दो महीना हुआ उसे पाठकपुर साथ में तैयारी में वीडियो को बताती हूं तेरे से मैं अभी दीदी को बताती हूं भजन करने के लिए बता सर्जरी करवाना चाहिए गर्भवती महिला और बच्चे का भी नहीं तो बताती हूं साफ सफाई करने के लिए बहुत जरूरी है कि महिला को 2 घंटे आराम करना चाहिए वीडियो में बता दो टीकाकरण हो रहा है वीडियो को बता रहे हैं खान पान के बारे में "
# u = "देशभर के विभिन्न प्रकार के पूरी प्रेमी और फिर गूगल की स्थापना की 1948 की सभी भाई बहनों को "
# u = "नमस्कार आदाब सत श्री अकाल साथियों मैं हूं कालीचरण पर बजे स्वाभिमानी पर कल खेल जगत से खेल का आरंभ होगा न्यूजीलैंड और पाकिस्तान के बीच "
u = "गाजीपुर मोबाइल वाणी सुनना है सभी श्रोताओं को मेरा नमस्कार सोता हूं मैं हूं प्रमोद वर्मा और आप सुन रहे हैं गाजीपुर मोबाइल पानी बताओ मैं इस वक्त मौजूद हूं गाजीपुर जनपद के ब्लाक मोहम्मदाबाद में और आइए हम आज यहां के वीडियो श्री सुशील कुमार सिंह जी से सीधे जुड़े हैं और जानते हैं कुछ महत्वपूर्ण जानकारियां सर आपका हमारे चैनल गाजीपुर मोबाइल पानी में स्वागत है आप अपना परिचय देना मैं विकास अधिकारी सुशील कुमार सिंह विकासखंड मोहम्मदाबाद आप सभी लोगों को मेरा नमस्कार अभी तो है ब्लॉक लेवल से आ ग्रामीणों के लिए कौन-कौन सी योजनाएं चलाई जा रही हैं उसके बारे में थोड़ा हमें आज हमें जानकारी दीजिए सर प्रधानमंत्री आवास योजना मनरेगा और राज्य ग्रामीण निधि से जो प्लान 815 में बेतिया में भीड़ से नाली खरंजा का कार्य लोगों के लिए पेंशन विकलांग जनों के लिए जो उपकरण है वह सहायतार्थ दिए जाते हैं बाकी ब्लॉक स्तर पर ही पशुपालन विभाग मत्स्य विभाग जिला विभाग शिक्षा विभाग बाल विकास विभाग भी कार्य करते हैं बाल विकास विभाग द्वारा एक महत्वपूर्ण योजना पुष्टाहार के संबंध में चलाई जा रही है शिक्षा विभाग का देख ही रहे हैं इसी तरह मत्स्य व पशुपालन विभाग द्वारा फसलों से संबंधित सहायता दी जाती है किसी भी ब्लॉक स्तर पर ही कार्यरत हैं सामुदायिक स्वास्थ्य केंद्र जहां आम जनों का इलाज होता है और जो इलाज में समर्थ नहीं है उनके लिए गोल्डन कार्ड की सुविधा है ऐसा कहा जा रहा है कि आज सरकार की जो सबसे बड़ी योजनाएं है मनरेगा उसके तहत क्या स्थिति है आप लोगों को मनरेगा के तहत रोजगार देने की जो प्रक्रिया थी वह पूरी हुई है या नहीं बिल्कुल पूरी हुई आजीविका की बात सर आपने किए तो ग्रामीण आजीविका के तहत इस समय है जो है बहुत सारे आज जो है आदि का के साथ भी काम हो रहा है तो आज ही कुछ कार्य हैं उनके बारे में थोड़ा जानकारी देगा से भी मिल रही है 9 दिन का रोजगार अर्ध कुशल कुशल रोजगार में मनरेगा के तहत मिस्त्री वगैरह को दिया जा रहा है जो राज्य वित्त है उससे भी दिया जा रहा है एनआरएचएम के तहत जो गरीब महिलाएं हैं उनको समूह में संगठित करके और वह जो रोड जा रहे जैसे झाड़ू बनाना बल्ब बनाना चटाई बनाना छोटे मोटे वीडियो शुरू करना तो उसके लिए भी सहायता तो आपने बताया कि आजीविका के ताज समूह बनाया जाता है इसकी थोड़ी सी प्रक्रिया हम जानना चाहेंगे 15 में महिलाएं मिलते हैं ग्रामीण स्तर पर एक समूह का गठन करते हैं समूह के मूल रूप से यह होता है उनका उद्देश्य की महिलाएं और जो भी उनके पंद्रह सौ रुपया सरकार की तरफ से सुभाष ने दी जाती है और अभी बाद में जो धनराशि दी जाती है तो नियमित रूप से उसका हिसाब किताब रखें और जुनून को दे रहे हैं उस पैसे से इकट्ठा करती है जैसे मांगे तो कृपया करके दिखा कर लिया ₹500 तो किसी व्यक्ति को एक समय सदस्य को जरूरत है तो उसको दे दो पर्सेंट ब्याज देती है उसका रखरखाव करें उनको जब भी जरूरत होती तो बहुत बहुत धन्यवाद सर जो आपने इतना महत्वपूर्ण जानकारी दिया तो ऐसे ही तमाम जानकारियों के लिए सुनते रहिए गाजीपुर मोबाइल बानी धन्यवाद "
# print("Transcript : {}".format(u))
# u = 'पंजाब'

stts_df = pd.read_excel('/home/oniondev/Desktop/aman/gramvaani/voice_bot/ground_truth/dtmf_voice_comparison/data/loc_voice_stts.xlsx')
stts = stts_df['ML Transcript'].tolist()
aud_links = stts_df['Audio Link'].tolist()
prim_locs, sec_locs = [], []
for u in stts:
    try:
        print(u)
        loc3 = sthaan(u)
        print(loc3)
        loc3 = [(l[1], l[2], l[3]) for l in loc3]
        print(loc3)
        loc3 = get_clean_locs([loc3])
        loc3 = get_final_locs(loc3)
        print(loc3)
        loc3_prim, loc3_sec = get_secondary_locs(loc3)
        # print(loc)
        # print(loc2)
        # print(loc3_prim, loc3_sec)
        prim_locs.append(loc3_prim)
        sec_locs.append(loc3_sec)
    except:
        prim_locs.append('')
        sec_locs.append('')

out_df = pd.DataFrame({'Audio Link': aud_links, 'ML Transcript': stts, 'Primary Locations': prim_locs, 'Secondary Locations': sec_locs})
out_df.to_excel('/home/oniondev/Desktop/aman/gramvaani/voice_bot/ground_truth/dtmf_voice_comparison/data/loc_voice_entity_res.xlsx', index=False)    

# hi_en_df = pd.read_excel('hi_eng_cesus_data.xlsx').fillna('')
# server_loc_df = pd.read_excel('clean_locs_data.xlsx').fillna('')

# # Replace words which mean empty location with ''
# empty_words = ['other', 'others', 'not known', 'state', 'district', 'nok known']
# for col in ['States', 'Districts', 'Sub Districts']: 
#     for word in empty_words:
#         server_loc_df[col] = server_loc_df[col].str.strip().replace(word, '')

# ai_id = 731
# server_id = 'TPH4'

# loc_id = get_loc_id(loc3_prim[0], ai_id, server_id, hi_en_df, server_loc_df)
# print("Loc ID : {}".format(loc_id))



# [(0, ['उत्तराखण्ड'], ['अल्मोड़ा'], [], '')]

#[(0, ['बिहार', 'मध्य प्रदेश'], ['लखीसराय', 'होशंगाबाद'], ['पिपरिया'], '')]

# [(0, ['मध्य प्रदेश'], [], [], ''), (0, ['बिहार', 'मध्य प्रदेश'], ['लखीसराय', 'होशंगाबाद'], ['पिपरिया'], '')]

# [(0, ['बिहार'], ['सारण'], ['छपरा'], '')]

# [(0, ['बिहार'], ['सारण'], ['छपरा'], '')]


# hindi_stopwords = ["अंदर","अत","अदि","अप","अपना","अपनि","अपनी","अपने","अभि","अभी","आदि","आप","इंहिं","इंहें","इंहों","इतयादि","इत्यादि","इन","इनका","इन्हीं","इन्हेंसका","इसकि","इसकी","इसके","इसमें","इसि","इसी","इसे","उंहिं","उंहें","उंहों","उन","उनका","उनकि","उनकी","उनके","उनको","उन्हीं","उन्हें","उन्हों","उस","उसके","उसि","उसी","उसे","एसे","ऐसे","ओर","और","कइ","कई","कर","करता","करते","करना","करने","करें","कहते","कहा","का","काफि","काफ़ी","कि","किंहें","किंहों","कितना","किन्हें","किन्हों","किया","किर","की","कुछ","कुल","के","को","कोइ","कोई","कोन","कोनसा","कौन","कौनसा","गया","घर","जब","जहाँ","जहां","जा","जिंहें","जिंहों","जितना","जिधर","जिन","जिन्हें","जिन्हों","जैसा","जैसे","जो","तक","तब","तरह","तिंहें","तिंहों","तिन","तिन्हें","तिन्हों","तिस","तिसे","तो","था","थि","थी","थे","दबारा","दवारा","दिया","दुसरा","दुसरे","दूसरे","दो","निचे","निहायत","नीचे","ने","पर","पहले","पुरा","पूरा","पे","फिर","बनि","बनी","बहि","बही","बहुत","बाद","बाला","बिलकुल","भि","भितर","भी","भीतर","मगर","मानो","मे",हां","यहि","यही","या","यिह","ये","रखें","रवासा","रहा","रहे","ऱ्वासा","लिए","लिये","लेकिन","व","वगेरह","वरग","वर्ग","वह","वहाँ","वहां","वहिं","वहीं","वाले","वुह","वे","सकते","सबसे","सभि","सभी","साथ","साबुत","साभ","सारा","से","सो","हि","ही","हुअ","हुआ","हुइ","हुई","हुए","हे","हें","है","हैं","हो","होता","होति","होती","होते","होना","हपने","आप को","हमने","हमारा","अपना","हम","आप","आपका","तुम्हारा","अपने","आप","स्वयं","वह","इसे","उसके","खुद","को","कि","वह","उसकी","उसका","खुद","ही","यह","इसके","उन्या","जो","किसे","किसको","कि","ये","हूँ","होता","है","रहे","थी","थे","होना","गया","किया","जा रहा है","किया","है","है","पडा","होने","करना","करता","है","किया","रही",","जैसा","जब","तक","जबकि","की","पर","द्वारा","के","लिए","साथ","के","बारे","में","खिलाफ","बीच","में","के","माध्यम","से","दौरान","से","पहले","के","बाद","ऊपर","नीचे","कोचे","करने","में","निकल","बंद","से","अधिक","तहत","दुबारा","आगे","फिर","एक","बार","यहाँ","वहाँ","कब","कहाँ","क्यों","कैसे","सारे","किसी","दोनो","प्रत्येक","ज्यादा","अधिकांश"","में","कोई","मात्र","खुद","समान","इसलिए","बहुत","सकता","जायेंगे","जरा","चाहिए","अभी","और","कर","दिया","रखें","का","हैं","इस","होता","करने","ने","बनी","तो","ही","हवाले","बाद","लिए","सकते","इसमें","दो","वे","करते","कहा","वर्ग","कई","करें","होती","अपनी","उनके","यदि","हुई","जा","कहते","जब","होते","कोई","हुए","व","जैसे","सभी","करता"उस","आदि","इसकी","उनका","इसी","पे","तथा","भी","परंतु","इन","कम","दूर","पूरे","गये","तुम","मै","यहां","हुये","कभी","अथवा","गयी","प्रति","जाता","इन्हें","गई","अब","जिसजाती","तब","उसे","जाते","लेकर","बड़े","दूसरे","जाने","बाहर","स्थान","उन्हें","गए","ऐसे","जिससे","समय","दोनों","किए","रहती","इनके","इनका","इनकी","सकती","आज","कल","जिन्हेंतिन्हों","किन्हों","किन्हें","इत्यादि","इन्हों","उन्हों","बिलकुल","निहायत","इन्हीं","उन्हीं","जितना","दूसरा","कितना","साबुत","वग़ैरह","कौनसा","लिये","दिया","जिसे","तिसे","काफ़","पूरा","सारा","उनको","वहीं","जहाँ","जीधर","<feff>के","एवं","कुछ","कुल","रहा","जिस","जिन","तिस","तिन","कौन","किस","संग","यही","बही","उसी","मगर","कर","मे","एस","उन","सो","अत"]

# hindi_stopwords = ["अंदर","अत","अदि","अप","अपना","अपनि","अपनी","अपने","अभि","अभी","आदि","आप","इंहिं","इंहें","इंहों","इतयादि","इत्यादि","इन","इनका","इन्हीं","इन्हेंसका","इसकि","इसकी","इसके","इसमें","इसि","इसी","इसे","उंहिं","उंहें","उंहों","उन","उनका","उनकि","उनकी","उनके","उनको","उन्हीं","उन्हें","उन्हों","उस","उसके","उसि","उसी","उसे","एसे","ऐसे","ओर","और","कइ","कई","कर","करता","करते","करना","करने","करें","कहते","कहा","का","काफि","काफ़ी","कि","किंहें","किंहों","कितना","किन्हें","किन्हों","किया","किसे","की","कुछ","कुल","के","को","कोइ","कोई","कोन","कोनसा","कौन","कौनसा","गया","घर","जब","जहाँ","जहां","जा","जिंहें","जिंहों","जितना","जिधर","जिन","जिन्हें","जिन्हों","जैसा","जैसे","जो","तक","तब","तरह","तिंहें","तिंहों","तिन","तिन्हें","तिन्हों","तिस","तिसे","तो","था","थि","थी","थे","दबारा","दवारा","दिया","दुसरा","दुसरे","दूसरे","दो","निचे","निहायत","नीचे","ने","पर","पहले","पुरा","पूरा","पे","फिर","बनि","बनी","बहि","बही","बहुत","बाद","बाला","बिलकुल","भि","भितर","भी","भीतर","मगर","मानो","मे"यहां","यहि","यही","या","यिह","ये","रखें","रवासा","रहा","रहे","ऱ्वासा","लिए","लिये","लेकिन","व","वगेरह","वरग","वर्ग","वह","वहाँ","वहां","वहिं","वहीं","वाले","वुह","वे","सकते","सबसे","सभि","सभी","साथ","साबुत","साभ","सारा","से","सो","हि","ही","हुअ","हुआ","हुइ","हुई","हुए","हे","हें","है","हैं","हो","होता","होति","होती","होते","होना","अपने","आप को","हमने","हमारा","अपना","हम","आप","आपका","तुम्हारा","अपने","आप","स्वयं","वह","इसे","उसके","खुद","को","कि","वह","उसकी","उसका","खुद","ही","यह","इसके","उक्या","जो","किसे","किसको","कि","ये","हूँ","होता","है","रहे","थी","थे","होना","गया","किया","जा रहा है","किया","है","है","पडा","होने","करना","करता","है","किया","रही"क" "जैसा","जब","तक","जबकि","की","पर","द्वारा","के","लिए","साथ","के","बारे","में","खिलाफ","बीच","में","के","माध्यम","से","दौरान","से","पहले","के","बाद","ऊपर","नीचे","कनचे ,"करने","में","निकल","बंद","से","अधिक","तहत","दुबारा","आगे","फिर","एक","बार","यहाँ","वहाँ","कब","कहाँ","क्यों","कैसे","सारे","किसी","दोनो","प्रत्येक","ज्यादा","अधिकांशस" "में","कोई","मात्र","खुद","समान","इसलिए","बहुत","सकता","जायेंगे","जरा","चाहिए","अभी","और","कर","दिया","रखें","का","हैं","इस","होता","करने","ने","बनी","तो","ही",""वाले","बाद","लिए","सकते","इसमें","दो","वे","करते","कहा","वर्ग","कई","करें","होती","अपनी","उनके","यदि","हुई","जा","कहते","जब","होते","कोई","हुए","व","जैसे","सभी","करत,"उस","आदि","इसकी","उनका","इसी","पे","तथा","भी","परंतु","इन","कम","दूर","पूरे","गये","तुम","मै","यहां","हुये","कभी","अथवा","गयी","प्रति","जाता","इन्हें","गई","अब","जि"जाती","तब","उसे","जाते","लेकर","बड़े","दूसरे","जाने","बाहर","स्थान","उन्हें","गए","ऐसे","जिससे","समय","दोनों","किए","रहती","इनके","इनका","इनकी","सकती","आज","कल","जिन्"तिन्हों","किन्हों","किन्हें","इत्यादि","इन्हों","उन्हों","बिलकुल","निहायत","इन्हीं","उन्हीं","जितना","दूसरा","कितना","साबुत","वग़ैरह","कौनसा","लिये","दिया","जिसे","तिसे","कार","पूरा","सारा","उनको","वहीं","जहाँ","जीधर","<feff>के","एवं","कुछ","कुल","रहा","जिस","जिन","तिस","तिन","कौन","किस","संग","यही","बही","उसी","मगर","कर","मे","]स","उन","सो","अत"]

# hindi_stopwords = ['अंदर', 'अत', 'अदि', 'अप', 'अपना', 'अपनि', 'अपनी', 'अपने', 'अभि', 'अभी', 'आदि', 'आप', 'इंहिं', 'इंहें', 'इंहों', 'इतयादि', 'इत्यादि', 'इन', 'इनका', 'इन्हीं', 'इन्हें', 'इन्हों', 'इस', 'इसका', 'इसकि', 'इसकी', 'इसके', 'इसमें', 'इसि', 'इसी', 'इसे', 'उंहिं', 'उंहें', 'उंहों', 'उन', 'उनका', 'उनकि', 'उनकी', 'उनके', 'उनको', 'उन्हीं', 'उन्हें', 'उन्हों', 'उस', 'उसके', 'उसि', 'उसी', 'उसे', 'एक', 'एवं', 'एस', 'एसे', 'ऐसे', 'ओर', 'और', 'कइ', 'कई', 'कर', 'करता', 'करते', 'करना', 'करने', 'करें', 'कहते', 'कहा', 'का', 'काफि', 'काफ़ी', 'कि', 'किंहें', 'किंहों', 'कितना', 'किन्हें', 'किन्हों', 'किया', 'किर', 'किस', 'किसि', 'किसी', 'किसे', 'की', 'कुछ', 'कुल', 'के', 'को', 'कोइ', 'कोई', 'कोन', 'कोनसा', 'कौन', 'कौनसा', 'गया', 'घर', 'जब', 'जहाँ', 'जहां', 'जा', 'जिंहें', 'जिंहों', 'जितना', 'जिधर', 'जिन', 'जिन्हें', 'जिन्हों', 'जिस', 'जिसे', 'जीधर', 'जेसा', 'जेसे', 'जैसा', 'जैसे', 'जो', 'तक', 'तब', 'तरह', 'तिंहें', 'तिंहों', 'तिन', 'तिन्हें', 'तिन्हों', 'तिस', 'तिसे', 'तो', 'था', 'थि', 'थी', 'थे', 'दबारा', 'दवारा', 'दिया', 'दुसरा', 'दुसरे', 'दूसरे', 'दो', 'द्वारा', 'न', 'नहिं', 'नहीं', 'ना', 'निचे', 'निहायत', 'नीचे', 'ने', 'पर', 'पहले', 'पुरा', 'पूरा', 'पे', 'फिर', 'बनि', 'बनी', 'बहि', 'बही', 'बहुत', 'बाद', 'बाला', 'बिलकुल', 'भि', 'भितर', 'भी', 'भीतर', 'मगर', 'मानो', 'मे', 'में', 'यदि', 'यह', 'यहाँ', 'यहां', 'यहि', 'यही', 'या', 'यिह', 'ये', 'रखें', 'रवासा', 'रहा', 'रहे', 'ऱ्वासा', 'लिए', 'लिये', 'लेकिन', 'व', 'वगेरह', 'वरग', 'वर्ग', 'वह', 'वहाँ', 'वहां', 'वहिं', 'वहीं', 'वाले', 'वुह', 'वे', 'वग़ैरह', 'संग', 'सकता', 'सकते', 'सबसे', 'सभि', 'सभी', 'साथ', 'साबुत', 'साभ', 'सारा', 'से', 'सो', 'हि', 'ही', 'हुअ', 'हुआ', 'हुइ', 'हुई', 'हुए', 'हे', 'हें', 'है', 'हैं', 'हो', 'होता', 'होति', 'होती', 'होते', 'होना', 'होने']
